Autodesk.Revit.DB.SolidCurveIntersection.GetEnumerator
Returns an enumerator that iterates through a collection.
Returns: An IEnumerator object that can be used to iterate through the collection.

Autodesk.Revit.DB.SolidCurveIntersection.GetBasicIEnumerator
Returns an enumerator that iterates through a collection.
Returns: An IEnumerator object that can be used to iterate through the collection.

Autodesk.Revit.DB.SolidCurveIntersection.GetSolidCurveIntersectionIterator
Returns a solid curve intersection iterator that iterates through the collection.
Returns:
A solid curve intersection iterator object that can be used to iterate through key-value pairs in the collection.
Since:
2013

Autodesk.Revit.DB.SolidCurveIntersection.GetCurveSegmentExtents(System.Int32)
Gets the extents for the given curve segment generated by intersection.
Remarks:
The parameters are raw parameters based on the raw parameter extents of the original input curve.
index:
The index.
Returns:
The curve extents.
Throws Autodesk.Revit.Exceptions.ArgumentException:
index is out of range.
Since:
2013

Autodesk.Revit.DB.SolidCurveIntersection.GetCurveSegment(System.Int32)
Gets the curve segment generated by intersection.
index:
The index.
Returns:
The curve.
Throws Autodesk.Revit.Exceptions.ArgumentException:
index is out of range.
Since:
2013

Autodesk.Revit.DB.SolidCurveIntersection.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.SolidCurveIntersection.SegmentCount
The number of segments in the results.
Since:
2013

Autodesk.Revit.DB.SolidCurveIntersection.ResultType
The result type used to calculate the intersections.
Since:
2013

Autodesk.Revit.DB.SolidCurveIntersection
This class represents the results of a calculation of intersection between a solid volume and a curve.
Remarks:
The results contain a collection of curves and a collection of curve extents (which are the parameters of intersection
from the original input curve).  Depending on the SolidCurveIntersectionMode option passed when
executing the calculation, the curve segments and curve extents represent either the extents of the curve
which exist inside the solid, or the extents of the curve which exist outside the solid.
If the curve is entirely inside the solid, and the option is CurveSegmentsOutside, or if the curve
is entirely outside the solid, and the option is CurveSegmentsInside, this results object will be empty.
Note that curves aligned with the bounding faces of the solid are considered to be inside by this utility.
Since:
2013